<template>
  <div class="personal-data">
    <p>Согласие на обработку персональных данных</p>
    <p>Физическое лицо, регистрируясь на веб-сайте https://junior-job.ru,
    действуя свободно, своей волей и в своем интересе
    а также подтверждая свою дееспособность,
    предоставляет свое согласие на обработку персональных данных
    (далее – Согласие) Чернявскому Ивану Дмитриевичу,
    которому принадлежит веб-сайт https://junior-job.ru на
    обработку своих персональных данных со следующими условиями:
    Данное Согласие дается на обработку персональных данных,
    как без использования средств автоматизации, так
    и с их использованием.
    </p>
    <p>1. Согласие дается на обработку следующих моих персональных данных: персональные данные,
      не относящиеся специальной категории персональных данных или к биометрическим персональным
      данным: адрес электронной почты (e-mail); имя, фамилию, отчество; номер
      мобильного телефона.</p>
    <p>
      2. Цель обработки персональных данных: предоставление
      доступа Пользователю к сервисам, информации и/или материалам,
      содержащимся на веб-сайте и информирование Пользователя
      посредством отправки электронных писем
    </p>
    <p>
      3. В ходе обработки с персональными данными будут
      совершены следующие действия: сбор; запись; систематизация; накопление;
      хранение; уточнение (обновление, изменение); извлечение; использование;
      передача (предоставление, доступ); блокирование; удаление; уничтожение.
    </p>
    <p>
      4. Третьи лица не обрабатывают персональные данные по поручению Чернявского
      Ивана Дмитриевича для указанной в согласии цели.
    </p>
    <p>
      5. Персональные данные обрабатываются до отказа в
      дальнейшем сотрудничестве или до заключения договора
       оказание услуги, смотря что произойдет быстрее.
    </p>
    <p>
      6. Согласие может быть отозвано вами или вашим представителем
      путем направления Чернявскому Ивану Дмитриевичу письменного
      заявления или электронного заявления, подписанного согласно
      законодательству Российской Федерации в области электронной
      подписи, по адресу, указанному в начале Согласия.
    </p>
    <p>
      7. В случае отзыва вами или вашим представителем
       Согласия Чернявский Иван Дмитриевич вправе продолжить
        обработку персональных данных без него при наличии оснований,
         указанных в пунктах 2 – 11 части 1 статьи 6, части 2 статьи 10
          и части 2 статьи 11 Федерального закона №152-ФЗ «О персональных данных» от 27.07.2006 г.
    </p>
    <p>
      8. Настоящее согласие действует все время до момента прекращения
      обработки персональных данных, указанных в п.6 и п.7 Согласия.
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'personalData',
  data: () => ({
  }),
  components: {},
  props: {},
  computed: {},
  methods: {},
  mounted () { },
})
</script>

<style lang="scss">
// .personal-data- {}
</style>
